[Survived] Statement mutation
18.Mutation_Testing_StrykerDemo/StrykerDemo/Calculator/CalculatorEngine.cs:31:17
         {
             if(b == 0)
             {
-                throw new DivideByZeroException();
+                ;
             }
             return a / b;
