[Killed] Arithmetic mutation
18.Mutation_Testing_StrykerDemo/StrykerDemo/Calculator/CalculatorEngine.cs:33:20
            // {
                // throw new DivideByZeroException();
             //}
-            return a / b;
+            return a * b;
         }
     }
killedBy: CalculatorTests.CalculatorTests.TestDivideFunction(4,2,2); CalculatorTests.CalculatorTests.TestDivideFunction_ShouldThrowException_WhenDivideByZero(1,0)
