[Killed] Statement mutation
18.Mutation_Testing_StrykerDemo/StrykerDemo/Calculator/CalculatorEngine.cs:31:17
         {
            if(b == 0)
             {
-                throw new ArgumentException();
+                ;
             }
             return a / b;
killedBy: CalculatorTests.CalculatorTests.TestDivideFunction_ShouldThrowException_WhenDivideByZero(1,0)
