[Killed] Arithmetic mutation
18.Mutation_Testing_StrykerDemo/StrykerDemo/Calculator/CalculatorEngine.cs:14:20
 
         public int Sum(int a, int b)
         {
-            return a + b;
+            return a - b;
         }
 
killedBy: CalculatorTests.CalculatorTests.TestSumFunction(5,5,10)

[Killed] Arithmetic mutation
18.Mutation_Testing_StrykerDemo/StrykerDemo/Calculator/CalculatorEngine.cs:19:20
 
         public int Substract(int a, int b)
         {
-            return a - b;
+            return a + b;
         }
 
killedBy: CalculatorTests.CalculatorTests.TestSubstractFunction(5,5,0)

[Killed] Arithmetic mutation
18.Mutation_Testing_StrykerDemo/StrykerDemo/Calculator/CalculatorEngine.cs:24:20
 
         public int Multiply(int a, int b)
         {
-            return a * b;
+            return a / b;
         }
 
killedBy: CalculatorTests.CalculatorTests.TestMultiplyFunction(5,2,10)

[Survived] Equality mutation
18.Mutation_Testing_StrykerDemo/StrykerDemo/Calculator/CalculatorEngine.cs:29:15
 
         public int Divide(int a, int b)
         {
-           if(b == 0)
+           if(b != 0)
             {
                 ;

[Survived] Block removal mutation
18.Mutation_Testing_StrykerDemo/StrykerDemo/Calculator/CalculatorEngine.cs:30:13
         public int Divide(int a, int b)
         {
            if(b == 0)
-            {
-                ;
-            }
+            {}
             return a / b;
         }

[Killed] Arithmetic mutation
18.Mutation_Testing_StrykerDemo/StrykerDemo/Calculator/CalculatorEngine.cs:33:20
             {
                 ;
             }
-            return a / b;
+            return a * b;
         }
     }
killedBy: CalculatorTests.CalculatorTests.Divide_ByZero_ShouldThrowDivideByZeroException(1,0); CalculatorTests.CalculatorTests.TestDivideFunction(4,2,2)
